<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Preperson (Unidentified Patient) Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for unidentified patients (prepersons).
    |
    */

    'label' => 'Неідентифіковані пацієнти',
    'label_single' => 'Неідентифікований пацієнт',
    'recent' => 'Нещодавні неідентифіковані пацієнти',

    'warning_title' => 'Попередження',
    'warning_text' => "Неідентифікований пацієнт може бути створений лише за необхідністю внесення медичних записів в процесі надання послуг пацієнту в стаціонарних умовах якщо:\n- пацієнт залишається на момент реєстрації в непритомному стані або в стані амнезії та отримує меддопомогу в стаціонарних умовах;\n- пацієнт є новонародженою дитиною без свідоцтва про народження;\n- пацієнт на момент реєстрації не має документів, що посвідчують особу, внаслідок їх втрати;\n- зафіксована смерть неідентифікованого пацієнта.",
    'reason' => 'Причина створення неідентифікованого пацієнта',
    'reasons' => [
        'EMERGENCY_HOSPITALIZATION' => 'Госпіталізація пацієнта бригадою екстреної медичної допомоги',
        'POLICE_HOSPITALIZATION' => 'Госпіталізація пацієнта з обставинами які потребують виклику поліції',
        'NEWBORN_WITHOUT_CERTIFICATE' => 'Пацієнт є новонародженою дитиною без свідоцтва про народження',
        'OTHER_HOSPITALIZATION' => 'Інші обставини звернення для госпіталізації'
    ],
    'ambulance_card_number' => '№ картки виїзду швидкої медичної допомоги',
    'police_report_id' => 'Ідентифікатор заяви в поліцію',
    'police_report_date' => 'Дата подання заяви в поліцію',
    'child_birth_time' => 'Час народження дитини',
    'other_reason' => 'Причини та обставини звернення пацієнта',
    'notes' => [
        'ambulance' => '№ картки виїзду швидкої медичної допомоги: :number',
        'police' => 'Ідентифікатор заяви в поліцію: :id; дата подання заяви в поліцію: :date',
        'newborn' => 'Час народження дитини: :time'
    ],
    'modal_title' => 'Необхідно створити подію та запис в ЕСОЗ',
    'modal_text' => 'Для неідентифікованого пацієнта повинен бути переданий мінімальний набір медичних даних, а саме спостереження стосовно стану, особливих прикмет неідентифікованого пацієнта (наявність татуювання, відсутність зубів, приблизний вік та інші прикмети).',
    'modal_warning_text' => 'Перші медичні дані неідентифікованого пацієнта повинні бути поданими протягом часу (24 години), відведеного з моменту створення такого пацієнта. У разі їх відсутності неідентифікований пацієнт автоматично деактивується в ЕСОЗ.',
    'modal_btn_later' => 'Продовжити пізніше',
    'modal_btn_create' => 'Створити подію та запис',
    'emergency_contact_mother_or_father' => 'Контактна особа (мати чи батько)',
    'register_death' => 'Зареєструвати смерть',
    'get_certificate' => 'Сформувати довідку',
    'note' => 'Примітка',
    'identification' => 'Ідентифікація пацієнта',
    'associate_patient' => 'Приєднати записи неідентифікованого пацієнта до записів ідентифікованого пацієнта',
    'external_id' => "ID пацієнта в закладі охорони здоров'я",
    'contact_person' => 'Контактна особа',
    'info_certificate' => 'Інформаційна довідка',
    'emergency_contact_phones' => "Контактні телефони для екстреного зв'язку",
    'contact_first_name' => "Ім'я контактної особи",
    'contact_last_name' => 'Прізвище контактної особи',
    'contact_second_name' => 'По-батькові контактної особи',
    'print' => 'Надрукувати',
    'delete_draft' => 'Видалити чернетку',
    'confirm_delete_draft' => 'Ви впевнені, що хочете видалити цю чернетку? Цю дію не можна скасувати.',

    'messages' => [
        'draft_created' => 'Чернетку неідентифікованого пацієнта успішно створено.',
        'draft_updated' => 'Чернетку неідентифікованого пацієнта успішно оновлено.',
        'draft_deleted' => 'Чернетку неідентифікованого пацієнта успішно видалено.',
        'created' => 'Неідентифікований пацієнт успішно створений'
    ],

    'policy' => [
        'edit' => 'У вас немає дозволу на продовження реєстрації неідентифікованого пацієнта.',
        'delete' => 'У вас немає дозволу на видалення чернетки неідентифікованого пацієнта.'
    ]
];
